Repository: MaxEtMoritz/PNavCopy
Catalog: CompanionBot/CompanionBot/Properties/Resources.*.resx
Languages: de

source: Action Required!
de: Aktion erforderlich!

source: Address:
de: Adresse:

source: Creations
de: Erstellungen

# currentBotState
source: Current bot status
de: Aktueller Bot-Status

# currentlyXServers
source: The bot is currently in {0} servers. Not yet processed data:
de: Der Bot befindet sich aktuell in {0} Servern. Noch nicht verarbeitete Daten:

# dataByBot
source: Data by PNavCopy
de: Daten von PNavCopy

# downloadFailed
source: Download of attached file failed: {0}
de: Download der angehängten Datei fehlgeschlagen: {0}

# editMultiMatches
source: Please select the correct location. If you are not sure, let it time out. The following info is available:
de: Bitte wählen Sie den korrekten Standort aus. Falls Sie unsicher sind, lassen Sie die Zeit ablaufen. Folgende Informationen sind verfügbar:

source: Edits
de: Bearbeitungen

source: Edits:
de: Bearbeitungen:

# embedFooter
source: use /pause or /resume commands to manage the import
de: Verwenden Sie die /pause oder /resume-Kommandos um den Importvorgang zu verwalten

# errorBadArgs
source: ⚠ Too many or few parameters. ⚠ Error message: ```{0}``` Please contact the bot owner by opening an issue at [GitHub](https://github.com/MaxEtMoritz/PNavCopy), providing what you did and which parameters you specified.
de: :warning: Zu viele oder zu wenige Parameter. :warning: Fehlermeldung: ```{0}``` Bitte kontaktieren Sie den Entwickler indem sie ein Issue auf [GitHub](https://github.com/MaxEtMoritz/PNavCopy) eröffnen und angeben, was Sie tun wollten und welche Parameter Sie angegeben haben.

# ErrorConvertFailed
source: ⚠ One or more parameters could not be converted. ⚠ Error message: ```{0}``` Please check your parameters. If they seem correct, open up an issue at [GitHub](https://github.com/MaxEtMoritz/PNavCopy), providing what you did, which parameters you entered and what the error message was.
de: :warning: Ein oder mehrere Parameter konnten nicht konvertiert werden. :warning: Fehlermeldung: ```{0}``` Bitte überprüfen Sie Ihre Parameter. Wenn Diese richtig zu sein scheinen, eröffnen Sie ein Issue auf [GitHub](https://github.com/MaxEtMoritz/PNavCopy) und geben Sie an, was Sie getan haben und welche Parameter Sie angegeben haben.

# errorException
source: ⚠ Internal Error. ⚠ The bot has encountered a problem while executing this interaction. If the error persists, please open an issue at [GitHub](https://github.com/MaxEtMoritz/PNavCopy), providing as much information as possible. This Error message will (hopefully😅) help the developer investigate: ```{0}```
de: :warning: Interner Fehler. :warning: Es ist ein Fehler bei der Ausführung dieses Befehls aufgetreten. Wenn der Fehler wiederholt auftritt, eröffnen Sie einen Issue auf [GitHub](https://github.com/MaxEtMoritz/PNavCopy) und geben Sie so viel Information wie möglich an. Diese Fehlermeldung wird dem Entwickler (hoffentlich:sweat_smile:) bei der Fehlerbehebung helfen: ```{0}```

# errorParseFailed
source: ⚠ Internal Error. ⚠ The bot has encountered a problem while executing this interaction. If the error persists, please open an issue at [GitHub](https://github.com/MaxEtMoritz/PNavCopy), providing as much information as possible. This Error message will (hopefully😅) help the developer investigate: ```{0}```
de: :warning: Interner Fehler. :warning: Es ist ein Fehler bei der Ausführung dieses Befehls aufgetreten. Wenn der Fehler wiederholt auftritt, eröffnen Sie einen Issue auf [GitHub](https://github.com/MaxEtMoritz/PNavCopy) und geben Sie so viel Information wie möglich an. Diese Fehlermeldung wird dem Entwickler (hoffentlich:sweat_smile:) bei der Fehlerbehebung helfen: ```{0}```

# ErrorUnknownCommand
source: ⚠ Unknown interaction. ⚠ Please contact the bot owner by opening an issue at [GitHub](https://github.com/MaxEtMoritz/PNavCopy), providing what you were trying to do when getting this error.
de: :warning: Unbekannter Befehl. :warning: Bitte kontaktieren Sie den Entwickler, indem Sie einen Issue auf [GitHub](https://github.com/MaxEtMoritz/PNavCopy) eröffnen und angeben, was Sie tun wollten als der Fehler auftrat.

# goodbye
source: Disconnecting now. Goodbye!
de: Beende jetzt die Verbindung. Servus!

source: Guild ID
de: Server-ID

source: Importing...
de: Importiere...

# interactionUnsuccessful
source: ❌ This interaction failed. ❌ Reason: {0}
de: :x: Dieser Befehl ist fehlgeschlagen. :x: Grund: {0}

# invalidCommandStructure
source: Invalid command structure: {0}.
de: Ungültige Befehlsstruktur: {0}.

# jsonParsingFailed
source: Error while parsing file: {0}
de: Fehler beim Parsen der Datei: {0}

# locationIdParseFailed
source: Error: Parsing of PokeNav ID failed.
de: Fehler: Parsen der PokeNav-ID fehlgeschlagen.

# modChannelFail
source: Did not receive a Response from PokeNav in time. Make sure PokeNav is able to respond in the Channel where you execute the command.
de: Keine rechtzeitige Antwort von PokeNav erhalten. Stellen Sie sicher, dass PokeNav in dem Kanal antworten kann, in dem Sie den Befehl ausführen.

# modChannelProblem
source: There was a problem with the mod-channel. Try to run `/mod-channel` and then `/resume` to try again.
de: Es gibt ein Problem mit dem PokeNav-Administrationskanal. Versuchen Sie `/mod-channel` und danach `/resume` auszuführen um es erneut zu versuchen.

# modChannelSuccess
source: Moderation channel successfully set to <#{0}>
de: PokeNav-Administrationskanal erfolgreich auf <#{0}> festgelegt

# modChannelUnset
source: PokeNav Moderation Channel not set yet. Run `/mod-channel` to set it, then run `/resume` to create the PoI.
de: PokeNav-Administrationskanal noch nicht gesetzt. Führen Sie {0} aus, um Ihn zu setzen, danach {1} um es erneut zu versuchen.

# noMsgHistoryPerm
source: Message History permission missing. Unable to handle location select dialog => edit skipped.
de: Berechtigung "Nachrichtenverlauf anzeigen" nicht erteilt. Der PoI-Auswahldialog kann deshalb nicht verarbeitet werden => Die Bearbeitung wurde übersprungen.

# numCreations
source: # creations
de: # Erstellungen

# numEdits
source: # edits
de: # Bearbeitungen

# parameterMismatch
source: Too few or too many parameters. Expected {0} to {1}.
de: Zu viele oder zu wenige Parameter. {0} bis {1} Parameter wurden erwartet.

# parameterMultiMatches
source: There are multiple matches for one or more parameters. Please refine your query. ```{0}```
de: Ein oder mehr Parameter sind mehrdeutig. Bitte überarbeiten Sie Ihre Anfrage. ```{0}```

# paramParseFailed
source: Could not parse Command parameter(s): {0}.
de: Konnte mindestens einen Parameter nicht parsen: {0}.

source: Paused
de: Pausiert

# pauseError
source: ❌ Error while pausing
de: :x: Fehler beim Pausieren

# pauseInProgress
source: ⏸ Pausing, please be patient...
de: :pause_button: Pausiere, etwas Geduld bitte...

# pauseNoOp
source: ℹ Nothing to Pause here, no Bulk Import running at the moment.
de: :information_source: Nichts zu Pausieren hier, da momentan kein Massen-Import läuft.

# pauseSuccessful
source: ✅ Successfully paused!
de: :white_check_mark: Erfolgreich pausiert!

# poiNotFound
source: Edit Failed. PoI not found.
de: Bearbeitung fehlgeschlagen. PoI nicht gefunden.

# pokeNavTimeout
source: PokeNav did not respond in time. Please try again manually.
de: PokeNav hat nicht rechtzeitig geantwortet. Bitte versuchen Sie es manuell erneut.

# pokeNavUpdateTimeout
source: PokeNav did not update the select message in time, please try again manually.
de: PokeNav hat die Auswahl-Nachricht nicht rechtzeitig aktualisiert, Bitte versuchen Sie es manuell erneut.

# probablyFinished
source: Probably finished {0}
de: Voraussichtlich fertig {0}

# promptMissingPerms
source: ⚠ Attention! ⚠ The Bot is missing permissions in the PokeNav mod-channel: {0} View Channel {1} Send Messages {2} Add Reactions (recommended but optional) {3} View message history (for ambiguous edits) Make sure to grant the neccessary permissions for the bot for <#{4}>.
de: :warning: Achtung! :warning: Dem Bot fehlen Berechtigungen im PokeNav-Administrationskanal: {0} Kanal anzeigen {1} Nachrichten senden {2} Reaktionen hinzufügen (empfohlen aber optional) {3} Nachrichtenverlauf anzeigen (für mehrdeutige Bearbeitungen) Stellen Sie sicher, dass Sie dem Bot die nötigen Berechtigungen für <#{4}> erteilen.

# reactTimeout
source: No one reacted. Please try again manually.
de: Niemand hat eine Reaktion hinzugefügt. Bitte versuchen Sie es manuell erneut.

# resume
source: ▶ Continuing...
de: :arrow_forward: Setze fort...

# resumeAlreadyRunning
source: ℹ Bulk import is already running, no need to resume.
de: :information_source: Massen-Import läuft bereits, er muss nicht fortgesetzt werden.

# resumeForPrediction
source: /resume to see prediction
de: {0}, um Vorhersage zu sehen

# resumeNoOp
source: ℹ No data to import present.
de: :information_source: Keine weiteren Daten zum Importieren vorhanden.

# selectRightLocation
source: Head to <#{0}> and select the right location!
de: Gehen Sie in <#{0}> und wählen Sie den korrekten Standort aus!

# stillToDo
source: This is still to do:
de: Folgendes ist noch zu tun:

# sure
source: Are you really sure? The bot will need manual restart if you do this!
de: Sind Sie wirklich sicher? Der Bot muss manuell neu gestartet werden, wenn Sie diesen Befehl ausführen!

# testInstance
source: This is the test instance.
de: Dies ist die Test-Instanz.

# textCommandException
source: ⚠ Internal Error. ⚠ The bot has encountered a problem while executing this command. If the error persists, please open a GitHub issue at https://github.com/MaxEtMoritz/PNavCopy, providing as much information as possible. This Error message will (hopefully😅) help the developer investigate: ```{0}```
de: :warning: Interner Fehler. :warning: Es ist ein Fehler bei der Ausführung dieses Befehls aufgetreten. Wenn der Fehler wiederholt auftritt, eröffnen Sie einen GitHub-Issue unter https://github.com/MaxEtMoritz/PNavCopy und geben Sie so viel Information wie möglich an. Diese Fehlermeldung wird dem Entwickler (hoffentlich:sweat_smile:) bei der Fehlerbehebung helfen: ```{0}```

# textCommandUnsuccessful
source: This command failed: {0}.
de: Dieser Befehl schlug fehl: {0}.

source: Time remaining
de: Verbleibende Zeit

source: Type:
de: Art:

# unmetPrecondition
source: ❌ This interaction is not allowed in the current context. ❌ {0}
de: :x: Dieser Befehl ist im aktuellen Kontext nicht erlaubt. :x: {0}

# unmetPreconditionTextBased
source: This command is not allowed in the current context: {0}.
de: Dieser Befehl ist im aktuellen Kontext nicht erlaubt: {0}.

source: Yes i am
de: Ja, bin ich
